Repository: OpenRTX/OpenRTX
Catalog: openrtx/src/locale/*.po
Languages: uk_ua

source: English
uk_ua: Українська

source: OFF
uk_ua: ВИМК.

source: ON
uk_ua: УВІМК.

source: Banks
uk_ua: Набори

source: Channels
uk_ua: Канали

source: Contacts
uk_ua: Контакти

source: Settings
uk_ua: Налаштування

source: Backup & Restore
uk_ua: Резервна копія та відновлення

source: Info
uk_ua: Інформація

source: About
uk_ua: Про нас

source: Display
uk_ua: Дисплей

source: Time & Date
uk_ua: Час і дата

source: Default Settings
uk_ua: За замовчуванням

source: Brightness
uk_ua: Яскравість

source: Contrast
uk_ua: Контраст

source: Timer
uk_ua: Таймер

source: GPS Enabled
uk_ua: GPS увімк.

source: GPS Set Time
uk_ua: Встанови час GPS

source: UTC Timezone
uk_ua: Часовий пояс UTC

source: Voice
uk_ua: Голос

source: Level
uk_ua: Рівень

source: Phonetic
uk_ua: Фонетично

source: Beep
uk_ua: Звук

source: Backup
uk_ua: Резервна копія

source: Restore
uk_ua: Відновити

source: Bat. Voltage
uk_ua: Напруга батареї

source: Bat. Charge
uk_ua: Заряд батареї

source: RSSI
uk_ua: Сила сигналу

source: Model
uk_ua: Модель

source: Band
uk_ua: Діапазон

source: LCD Type
uk_ua: Тип LCD

source: All channels
uk_ua: Всі канали

source: Menu
uk_ua: Меню

source: GPS OFF
uk_ua: GPS ВИМК.

source: No Fix
uk_ua: Не фікс.

source: Fix Lost
uk_ua: Втрачено

source: ERROR
uk_ua: ПОМИЛКА

source: Flash Backup
uk_ua: Резервна копія пам'яті Флеш

source: Connect to RTXTool
uk_ua: Підключи до RTXTool

source: to backup flash and
uk_ua: щоб зробити резервну копію пам'яті Флеш і

source: press PTT to start.
uk_ua: натисни PTT щоб почати.

source: Flash Restore
uk_ua: Відновлення пам'яті Флеш

source: to restore flash and
uk_ua: щоб відновити пам'ять Флеш і

source: GPS Settings
uk_ua: Налаштування GPS

source: M17 Settings
uk_ua: Налаштування M17

source: Callsign:
uk_ua: Позивний:

source: Reset to Defaults
uk_ua: Віднови налаштування за замовчуванням

source: To reset:
uk_ua: Щоб відновити:

source: Press Enter twice
uk_ua: Натисни Enter два рази

source: Macro Menu
uk_ua: Меню Макро

source: For emergency use
uk_ua: Для використання в аварійних ситуаціях

source: press any button.
uk_ua: натисни будь–якиу кнопку.

source: Accessibility
uk_ua: Доступність

source: Used heap
uk_ua: Використання стосу

source: Radio Settings
uk_ua: Налаштування радіо

source: Offset
uk_ua: Зсув

source: Macro Latch
uk_ua: Блокування меню Макро

source: No GPS
uk_ua: GPS відсутнє

source: Battery Icon
uk_ua: Іконка батареї

source: CTCSS Tone
uk_ua: Тон CTCSS

source: CTCSS En.
uk_ua: CTCSS увімк.

source: Encode
uk_ua: Кодуй

source: Decode
uk_ua: Декодуй

source: Both
uk_ua: Оба

source: None
uk_ua: Жодний

source: Direction
uk_ua: Напрямок

source: Step
uk_ua: Крок

source: Radio
uk_ua: Радіо

source: %.1fV
uk_ua: %.1fВ

source: 5 s
uk_ua: 5 сек.

source: 10 s
uk_ua: 10 сек.

source: 15 s
uk_ua: 15 сек.

source: 20 s
uk_ua: 20 сек.

source: 25 s
uk_ua: 25 сек.

source: 30 s
uk_ua: 30 сек.

source: 1 min
uk_ua: 1 мін.

source: 2 min
uk_ua: 2 мін.

source: 3 min
uk_ua: 3 мін.

source: 4 min
uk_ua: 4 мін.

source: 5 min
uk_ua: 5 мін.

source: 15 min
uk_ua: 15 мін.

source: 30 min
uk_ua: 30 мін.

source: 45 min
uk_ua: 45 мін.

source: 1 hour
uk_ua: 1 год.

source: %s%cHz
uk_ua: %s%cГц

source: %d.%dV
uk_ua: %d.%dВ

source: %<PRIi32>dBm
uk_ua: %<PRIi32>дБм

source: %dB
uk_ua: %dБ

source: S %dkm/h A %dm
uk_ua: V %dкм/год. H %dм

source: %d.%dW
uk_ua: %d.%dВт

source: Unlk
uk_ua: Рзбл

source: Lck
uk_ua: Блк

source: Cancel
uk_ua: Скасувати

source: Accept
uk_ua: Прийняти

source: S %4.1fkm/h A %4.1fm
uk_ua: V %4.1fкм/год. H %4.1fм

source: Time&Date
uk_ua: Час і дата

source: Module17 Settings
uk_ua: Налаштування Module17
